//  คำตอบที่ต้องการ
//  1) มีจำนวนนักเรียนทั้งหมดกี่คน
//  2) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" และมีจำนวนนักเรียนเท่ากับกี่คน
//  3) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" และมีจำนวนนักเรียนเท่ากับกี่คน
//  4) แสดงชื่อนักเรียนทั้งหมด และแสดงเพศของนักเรียนแต่ละคน
//  5) แสดงลำดับของนักเรียนแต่ละคน
        // มีจำนวนนักเรียนเท่ากับกี่คน
        // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
        // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
//  6) แสดงรายการพัสดุ พร้อมทั้งบอกว่ามาจากไทยหรือต่างประเทศ
        // มีแสดงจำนวนพัสดุทั้งหมดเท่าไหร่
        // มีจำนวนพัสดุที่มาจากไทยเท่าไหร่
        // มีจำนวนพัสดุที่มาจากต่างประเทศเท่าไหร่

package Temp;

public class W14_01_Array_showGender_useFor {
    public static void main(String[] args) {
        // สร้าง Array ชื่อ name เพื่อเก็บชื่อนักเรียน จำนวน 5 คน
        String [] name = {"นายสมชาย","นางสมใจ","นางสาวสมนึก","นายสมดี","นางสาวสมฤทัย"};
        String [] codes = {"123TH","124EN","125EN","126TH","127EN"};

        // 1) แสดงจำนวนนักเรียนทั้งหมด

        System.out.println("====================================");
        



        // 2) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" [startsWith()] และมีจำนวนนักเรียนเท่ากับกี่คน

        // แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย"
        System.out.println("ชื่อนักเรียนขึ้นต้นด้วยคำว่า 'นาย'");

        // และมีจำนวนนักเรียนเท่ากับกี่คน

  
        System.out.println("====================================");
        




        //  3) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" 
        System.out.println("ชื่อนักเรียนขึ้นต้นด้วยคำว่า 'นาง'");
 
        // และมีจำนวนนักเรียนเท่ากับกี่คน
    
        System.out.println("====================================");
        





        // 4) แสดงชื่อนักเรียนทั้งหมด และแสดงเพศของนักเรียนแต่ละคน
                // ถ้าชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" ให้แสดงว่าเป็นเพศชาย
                // ถ้าชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" ให้แสดงว่าเป็นเพศหญิง
        

        // มีจำนวนนักเรียนเท่ากับกี่คน
   
        System.out.println("====================================");







        // 5) แสดงเลขลำดับของนักเรียนแต่ละคน 
                // มีจำนวนนักเรียนเท่ากับกี่คน
                // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
                // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน


        // มีจำนวนนักเรียนเท่ากับกี่คน
        

        // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
        

        // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
        
        System.out.println("====================================");
        
        
        
    }
}

